/*
 Шаги реализации

1. Создайте интерфейс обработчика и опишите в нём основной метод обработки.
    Продумайте, в каком виде клиент должен передавать данные запроса в обработчик. Самый гибкий способ — превратить данные запроса в объект и передавать его целиком через параметры метода обработчика.
2. Имеет смысл создать абстрактный базовый класс обработчиков, чтобы не дублировать реализацию метода получения следующего обработчика во всех конкретных обработчиках.
    Добавьте в базовый обработчик поле для хранения ссылки на следующий объект цепочки. Устанавливайте начальное значение этого поля через конструктор. Это сделает объекты обработчиков неизменяемыми. Но если программа предполагает динамическую перестройку цепочек, можете добавить и сеттер для поля.
    Реализуйте базовый метод обработки так, чтобы он перенаправлял запрос следующему объекту, проверив его наличие. Это позволит полностью скрыть поле-ссылку от подклассов, дав им возможность передавать запросы дальше по цепи, обращаясь к родительской реализации метода.
3. Один за другим создайте классы конкретных обработчиков и реализуйте в них методы обработки запросов. При получении запроса каждый обработчик должен решить:
    Может ли он обработать запрос или нет?
    Следует ли передать запрос следующему обработчику или нет?
4. Клиент может собирать цепочку обработчиков самостоятельно, опираясь на свою бизнес-логику, либо получать уже готовые цепочки извне. В последнем случае цепочки собираются фабричными объектами, опираясь на конфигурацию приложения или параметры окружения.
5. Клиент может посылать запросы любому обработчику в цепи, а не только первому. Запрос будет передаваться по цепочке до тех пор, пока какой-то обработчик не откажется передавать его дальше, либо когда будет достигнут конец цепи.
6. Клиент должен знать о динамической природе цепочки и быть готов к таким случаям:
    Цепочка может состоять из единственного объекта.
    Запросы могут не достигать конца цепи.
    Запросы могут достигать конца, оставаясь необработанными.
 */

class Enemy {
    let strenght = 600
}

//1
protocol MilitaryChain {
    var strenght: Int { get }
    var nextRank: MilitaryChain? { get set }
    
    func shouldDefeatWithStrength(amount: Int)
}

//3
class Solder: MilitaryChain {
    var strenght = 100
    var nextRank: MilitaryChain?
    
    func shouldDefeatWithStrength(amount: Int) {
        if amount < strenght {
            print("Солдат победил")
        } else {
            nextRank?.shouldDefeatWithStrength(amount: amount)
        }
    }
}

class Officer: MilitaryChain {
    var strenght = 500
    var nextRank: MilitaryChain?
    
    func shouldDefeatWithStrength(amount: Int) {
        if amount < strenght {
            print("Офицер победил")
        } else {
            nextRank?.shouldDefeatWithStrength(amount: amount)
        }
    }
}

class General: MilitaryChain {
    var strenght = 1000
    var nextRank: MilitaryChain?
    
    func shouldDefeatWithStrength(amount: Int) {
        if amount < strenght {
            print("Генерал победил")
        } else {
            print("Вызывай подмогу!")
        }
    }
}

let enemy = Enemy()
let solider = Solder()
let officer = Officer()
let general = General()

solider.nextRank = officer
officer.nextRank = general

solider.shouldDefeatWithStrength(amount: enemy.strenght)
